УчетВУправляющихДляГит1/src/Documents/УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ/УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОВвозеИзЕАЭСГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераКиЗ</name>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDTID</name>
      <type>
        <types>DefinedType.RFIDTID</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDEPC</name>
      <type>
        <types>DefinedType.RFIDEPC</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/InformationRegisters/СтатусыИнформированияГИСМ/СтатусыИнформированияГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыИнформированияГИСМ</name>
  <resources>
    <name>ТекущееУведомление</name>
    <type>
      <types>DocumentRef.УведомлениеОбИмпортеМаркированныхТоваровГИСМ</types>
      <types>DocumentRef.УведомлениеОСписанииКиЗГИСМ</types>
      <types>DocumentRef.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформированияГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюГИСМ</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументИнформированияГИСМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/ОперацииОбменаГИСМ/ОперацииОбменаГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииОбменаГИСМ</name>
  <enumValues>
    <name>ПередачаДанных</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеНовогоСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПередачаПодтверждения</name>
  </enumValues>
  <enumValues>
    <name>ПередачаПодтвержденияПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаЗакрытияЗаявки</name>
  </enumValues>
  <enumValues>
    <name>ПередачаЗакрытияЗаявкиПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ПередачаАннулированияПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеПодтверждения</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеЗакрытияЗаявки</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеСпискаВходящихДокументов</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеGLNПоИННКПП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхСписаниеКиЗПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхМаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхМаркировкаТоваровПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхПеремаркировкаТоваровПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхВозвратФизическомуЛицуКомиссия</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхВозвратФизическомуЛицуКомиссияПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхОтгрузкаЗаПределыЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхОтгрузкаЗаПределыЕАЭСПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхОтгрузкаЭкспортЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхОтгрузкаЭкспортЕАЭСПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхСписаниеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхСписаниеТоваровПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхВвозМаркированнойПродукцииИзЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхВвозМаркированнойПродукцииИзЕАЭСПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхОтгрузкаМаркированныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхОтгрузкаМаркированныхТоваровПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхИмпортМаркированнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхИмпортМаркированнойПродукцииПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхВыбраковкаКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхВыбраковкаКиЗПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхРозничнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхРозничнаяПродажаПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхЗаявкаНаВыпускКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхЗаявкаНаВыпускКиЗПолучениеКвитанции</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхВозвратОтРозничногоПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхВозвратОтРозничногоПокупателяПолучениеКвитанции</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/СтатусыИнформированияГИСМ/СтатусыИнформированияГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыИнформированияГИСМ</name>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>КПередаче</name>
  </enumValues>
  <enumValues>
    <name>КПередачеСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>КПередачеМаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>КПередачеПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>Передано</name>
  </enumValues>
  <enumValues>
    <name>ПереданоСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПереданоМаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПереданоПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСММаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСММаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМПеремаркировкаТоваров</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ДальнейшиеДействияПоВзаимодействиюГИСМ/ДальнейшиеДействияПоВзаимодействиюГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДальнейшиеДействияПоВзаимодействиюГИСМ</name>
  <enumValues>
    <name>ЗакройтеЗаявку</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеПолучение</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанные</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанныеСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанныеМаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанныеПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>Аннулируйте</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеОбмен</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПередачуДанныхРегламентнымЗаданием</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПолучениеКвитанцииОФиксации</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеФормированиеСчетаНаОплату</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПодтверждениеПолучения</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеУтверждениеФНС</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ИсправьтеНекорректныеРеквизиты</name>
  </enumValues>
  <enumValues>
    <name>ПолучитеСчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>ОплатитеСчет</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеУведомлениеОВыпускеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеРегистрациюКлиентаВГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеЗакрытияУведомления</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Элементы.Подразделение.Видимость = ИнтеграцияГИСМ.ИспользоватьПодразделения();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = Неопределено;
	ИнтеграцияГИСМПереопределяемый.ВалютаРегламентированногоУчета(ВалютаРегламентированногоУчета);
	Элементы.НомераКиЗСтоимость.Заголовок = СтрЗаменить(НСтр("ru = 'Стоимость (%Валюта%)'"), "%Валюта%", ВалютаРегламентированногоУчета);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриСозданииЧтенииНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыЗаписи.Вставить("Основание", Объект.Основание);
	Оповестить("Запись_УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ", ПараметрыЗаписи, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомераКиЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент = Элементы.НомераКиЗНоменклатураПредставление Тогда
		ТекущиеДанные = Элементы.НомераКиЗ.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
			ПоказатьЗначение(Неопределено, ТекущиеДанные.Номенклатура);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусГИСМОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если (Не ЗначениеЗаполнено(Объект.Ссылка)) Или (Не Объект.Проведен) Тогда
		
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СтатусГИСМОбработкаНавигационнойСсылкиЗавершение",
		                                                    ЭтотОбъект,
		                                                    Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", НавигационнаяСсылкаФорматированнойСтроки));
		ТекстВопроса = НСтр("ru = 'Уведомление о ввозе маркированных товаров ЕАЭС не проведено. Провести?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли Модифицированность Тогда
		
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СтатусГИСМОбработкаНавигационнойСсылкиЗавершение",
		                                                    ЭтотОбъект,
		                                                    Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", НавигационнаяСсылкаФорматированнойСтроки));
		ТекстВопроса = НСтр("ru = 'Уведомление о ввозе маркированных товаров ЕАЭС было изменено. Провести?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПередатьДанные" Тогда
		
		ИнтеграцияГИСМКлиент.ПодготовитьСообщениеКПередаче(
			Объект.Ссылка,
			ПредопределенноеЗначение("Перечисление.ОперацииОбменаГИСМ.ПередачаДанных"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусГИСМОбработкаНавигационнойСсылкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		 Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Записать();
	КонецЕсли;
	
	Если Не Модифицированность И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработатьНажатиеНавигационнойСсылки(ДополнительныеПараметры.НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусГИСМ()

	СтатусГИСМ         = Перечисления.СтатусыИнформированияГИСМ.Черновик;
	ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПустаяСсылка();
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Статусы.Статус КАК Статус,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПустаяСсылка)
		|		ИНАЧЕ Статусы.ДальнейшееДействие
		|	КОНЕЦ КАК ДальнейшееДействие
		|ИЗ
		|	РегистрСведений.СтатусыИнформированияГИСМ КАК Статусы
		|ГДЕ
		|	Статусы.ТекущееУведомление = &УведомлениеОбВвозе";
		
		Запрос.УстановитьПараметр("УведомлениеОбВвозе", Объект.Ссылка);
		Запрос.УстановитьПараметр("МассивДальнейшиеДействия", ИнтеграцияГИСМ.НеотображаемыеВДокументахДальнейшиеДействия());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			СтатусГИСМ         = Выборка.Статус;
			ДальнейшееДействие = Выборка.ДальнейшееДействие;
			
		КонецЕсли;
		
	Иначе
		
		ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанные;
		
	КонецЕсли;
	
	СтатусГИСМПредставление = ИнтеграцияГИСМ.ПредставлениеСтатусаГИСМ(
		СтатусГИСМ,
		ДальнейшееДействие,
		Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Форма.ФормаДокумента.Записать");
	
	ОчиститьСообщения();
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Форма.ФормаДокумента.ЗаписатьИЗакрыть");
	
	ОчиститьСообщения();
	
	Если Записать() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НомераКиЗНоменклатураПредставление.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.НомераКиЗ.Номенклатура");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<В основании отсутствует>'"));

КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ОбновитьСтатусГИСМ();
	ИнтеграцияГИСМПереопределяемый.ЗаполнитьПредставлениеТоваровУведомленияПоНомерамКиЗОснования(Объект.Основание, Объект.НомераКиЗ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьСтатусГИСМ();
	ИнтеграцияГИСМПереопределяемый.ЗаполнитьПредставлениеТоваровУведомленияПоНомерамКиЗОснования(Объект.Основание, Объект.НомераКиЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеСостоянияГИСМ"
		И Параметр.Ссылка = Объект.Ссылка Тогда
		
		ОбновитьСтатусГИСМ();
		
	КонецЕсли;
	
	Если ИмяСобытия = "ВыполненОбменГИСМ"
		И (Параметр = Неопределено
		Или (ТипЗнч(Параметр) = Тип("Структура") И Параметр.ОбновлятьСтатусГИСМФормахВДокументах)) Тогда
		
		ОбновитьСтатусГИСМ();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
